<?php
/*
=====================================================
 https://webarmen.com/
-----------------------------------------------------
 Copyright (c) 2018
=====================================================
 Данный код защищен авторскими правами
=====================================================
 Файл: utilities.php
-----------------------------------------------------
 Назначение: вспомогательные функции
=====================================================
*/

class Utilities {

    public function error( $massage ) {
        $text = array(
            "status"   =>  "error",
            "message"  =>  $massage
        );

        die(json_encode($text));
    }

}
?>